export default {
  '我': {
    'baba': '爸爸',
    'mama': '妈妈',
    'gege': '哥哥',
    'didi': '弟弟',
    'jiejie': '姐姐',
    'meimei': '妹妹',
    'zhangfu': '丈夫',
    'qizi': '妻子',
    'erzi': '儿子',
    'nver': '女儿'
  },
  '爸爸': {
    'baba': '爷爷',
    'mama': '奶奶',
    'gege': '伯父',
    'didi': '叔叔',
    'jiejie': '姑妈',
    'meimei': '姑妈',
    'zhangfu': '未知',
    'qizi': '妈妈',
    'erzi': {
      'older': '哥哥',
      'middle': '我',
      'younger': '弟弟'
    },
    'nver': {
      'older': '姐姐',
      'middle': '我',
      'younger': '妹妹'
    }
  },
  '爷爷': {
    'baba': '太公',
    'mama': '太婆',
    'gege': '伯公',
    'didi': '叔伯',
    'jiejie': '姑奶奶',
    'meimei': '姑奶奶',
    'zhangfu': '未知',
    'qizi': '奶奶',
    'erzi': {
      'older': '伯父',
      'middle': '爸爸',
      'younger': '叔叔'
    },
    'nver': '姑妈'
  },
  '奶奶': {
    'baba': '外太公',
    'mama': '外太婆',
    'gege': '舅公',
    'didi': '舅公',
    'jiejie': '姨婆',
    'meimei': '姨婆',
    'zhangfu': '爷爷',
    'qizi': '未知',
    'erzi': {
      'older': '伯父',
      'middle': '爸爸',
      'younger': '叔叔'
    },
    'nver': '姑妈'
  },
  '外公': {

  },
  '外婆': {

  },
  '姑妈': {

  },
  '姑父': {

  },
  '伯父': {

  },
  '伯母': {

  },
  '叔叔': {

  },
  '婶婶': {

  },
  '妈妈': {

  },
  '舅舅': {

  },
  '舅妈': {

  },
  '姨妈': {

  },
  '姨夫': {

  },
  '哥哥': {

  },
  '嫂嫂': {

  },
  '弟弟': {

  },
  '弟媳': {

  },
  '姐夫': {

  },
  '姐姐': {

  },
  '妹妹': {

  },
  '妹夫': {

  },
  '儿子': {

  },
  '媳妇': {

  },
  '女儿': {

  },
  '女婿': {

  },
  '丈夫': {

  },
  '妻子': {

  },
  '大伯子': {

  },
  '小叔子': {

  },
  '大姑子': {

  },
  '小姑子': {

  },
  '大舅子': {

  },
  '小舅子': {

  },
  '大姨子': {

  },
  '小姨子': {

  },
  '太公': {

  },
  '太婆': {

  },
  '外太公': {

  },
  '外太婆': {

  },
  '孙子': {

  },
  '孙女': {

  },
  '外孙': {

  },
  '外孙女': {

  },
  '弟妹': {

  },
  '大妗子': {

  },
  '小妗子': {

  },
  '姑姥姥': {

  },
  '姑奶奶': {

  },
  '姻世伯': {

  },
  '姻世母': {

  },
  '姻伯公': {

  },
  '姑姥婆': {

  }
};
